app/Controllers/Asientos.php

    public function index(): string
    {
       $asientosM = model('AsientosM');
        $data['asientos']= $asientosM->findAll();
---
SELECT *
FROM `asientos`